Solidification/defense/002_y_Ha50_sol_1D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
        minIter         1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-8;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        minIter         1;
        maxIter         2;
    }

    TFinal
    {
        $T;
    }
    
    
    pB
    {
        $p_rgh;
        tolerance       1e-05;
        relTol          0;
    }

    pBFinal
    {
        $pB;
        relTol          0;
    }

    "(B)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 2;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    minTempCorrector 3;
    maxTempCorrector 150;
    alpha3Tolerance 1e-6;
    alpha3Relaxatio 0.7;
    pRefCell        0;
    pRefValue       0;
}

MELTING
{
    minTempCorrector 3;
    maxTempCorrector 150;
    alphaTolerance 1e-6;
    alphaRelaxation 0.7;
}

relaxationFactors
{
    fields
    {
		B               0.7;
    }
    equations
    {
		".*"          1.0;
    }
}

// ************************************************************************* //
